/**

 *Submitted for verification at Etherscan.io on 2018-09-16

*/



pragma solidity ^0.4.24;



//§£§Ñ§ã §á§â§Ú§Ó§Ö§ä§ã§ä§Ó§å§Ö§ä §Ü§à§Þ§Ñ§ß§Õ§Ñ §á§â§à§Ö§Ü§ä§Ñ SmartPromise

//§¥§Ñ§ß§ß§í§Û §Ü§à§ß§ä§â§Ñ§Ü§ä §Ò§å§Õ§Ö§ä §Ó§í§á§Ý§Ñ§é§Ú§Ó§Ñ§ä§î §£§Ñ§Þ 7% §à§ä §£§Ñ§ê§Ö§Ô§à §Ó§Ü§Ý§Ñ§Õ§Ñ §Ü§Ñ§Ø§Õ§í§Û §Õ§Ö§ß§î, §Ñ §ï§ä§à §Ù§ß§Ñ§é§Ú§ä, §é§ä§à §£§í §Ó§í§Û§Õ§Ö§ä§Ö §Ó §á§Ý§ð§ã §å§Ø§Ö §é§Ö§â§Ö§Ù 2 §ß§Ö§Õ§Ö§Ý§Ú

//§ª§ß§ã§ä§â§å§Ü§è§Ú§ð §à §ä§à§Þ, §Ü§Ñ§Ü §ã§Õ§Ö§Ý§Ñ§ä§î §Ó§Ü§Ý§Ñ§Õ §£§í §Þ§à§Ø§Ö§ä§Ö §ß§Ñ§Û§ä§Ú §ß§Ñ §ß§Ñ§ê§Ö§Þ §à§æ§Ú§è§Ú§Ñ§Ý§î§ß§à§Þ §ã§Ñ§Û§ä§Ö: 

//https://smartpromise.ru/

//§¦§ã§Ý§Ú §å §£§Ñ§ã §Ö§ã§ä§î §Ü§Ñ§Ü§Ú§Ö-§Ý§Ú§Ò§à §Ó§à§á§â§à§ã§í, §£§í §Þ§à§Ø§Ö§ä§Ö §Ù§Ñ§Õ§Ñ§ä§î §Ú§ç §ß§Ñ§ê§Ö§Þ§å §à§á§Ö§â§Ñ§ä§à§â§å §Ó telegram:

//https://t.me/smartpromise



//§¥§Ñ§Ý§Ö§Ö §á§â§Ö§Õ§ã§ä§Ñ§Ó§Ý§Ö§ß §Ú§ã§ç§à§Õ§ß§í§Û §Ü§à§Õ §ß§Ñ§ê§Ö§Ô§à §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ §ã §á§à§Õ§â§à§Ò§ß§í§Þ§Ú §Ü§à§Þ§Þ§Ö§ß§ä§Ñ§â§Ú§ñ§Þ§Ú, §Ü§à§ä§à§â§í§Ö §à§á§Ú§ã§í§Ó§Ñ§ð§ä §Ö§Ô§à §â§Ñ§Ò§à§ä§å

//§¬§à§ß§ä§â§Ñ§Ü§ä §Ù§Ñ§Ô§â§å§Ø§Ö§ß §Ó §Ò§Ý§à§Ü§é§Ö§Û§ß, §á§à§ï§ä§à§Þ§å §Ö§Ô§à §ß§Ö§Ý§î§Ù§ñ §Ú§Ù§Þ§Ö§ß§Ú§ä§î §Ú§Ý§Ú §å§Õ§Ñ§Ý§Ú§ä§î

//§³§à§Ù§Õ§Ñ§ä§Ö§Ý§î §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ §ß§Ö §Ú§Þ§Ö§Ö§ä §Õ§à§ã§ä§å§á §Ü §ã§â§Ö§Õ§ã§ä§Ó§Ñ§Þ, §Ü§à§ä§à§â§í§Ö §ç§â§Ñ§ß§ñ§ä§î§ã§ñ §ß§Ñ §Ü§à§ß§ä§â§Ñ§Ü§ä§Ö



contract SmartPromiseSEVEN {

   

    address owner; //§³§ð§Õ§Ñ §Ù§Ñ§á§à§Þ§Ú§ß§Ñ§Ö§Þ §Ñ§Õ§â§Ö§ã §â§Ö§Ü§Ý§Ñ§Þ§ß§à§Ô§à §æ§à§ß§Õ§Ñ §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ

    mapping (address => uint256) balances; //§©§Õ§Ö§ã§î §Þ§í §ç§â§Ñ§ß§Ú§Þ §á§Ñ§â§í §Ñ§Õ§â§Ö§ã -> §Ò§Ñ§Ý§Ñ§ß§ã

    mapping (address => uint256) timestamp; //§©§Õ§Ö§ã§î §Þ§í §ç§â§Ñ§ß§Ú§Þ §á§Ñ§â§í §Ñ§Õ§â§Ö§ã -> §Ó§â§Ö§Þ§ñ



    constructor() public { owner = msg.sender;} //§¿§ä§à §Ü§à§ß§ã§ä§â§å§Ü§ä§à§â, §Ü§à§ä§à§â§í§Û §Ó§í§Ù§í§Ó§Ñ§Ö§ä§ã§ñ §á§â§Ú §ã§à§Ù§Õ§Ñ§ß§Ú§Ú §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ §Õ§Ý§ñ §Ù§Ñ§á§à§Þ§Ú§ß§Ñ§ß§Ú§ñ §Ñ§Õ§â§Ö§ã§Ñ §Ö§Ô§à §Ó§Ý§Ñ§Õ§Ö§Ý§î§è§Ñ

//§¶§å§ß§Ü§è§Ú§ñ, §à§ã§å§ë§Ö§ã§ä§Ó§Ý§ñ§ð§ë§Ñ§ñ §Ó§í§á§Ý§Ñ§ä§í §Ú §à§Õ§ß§à§Ó§â§Ö§Þ§Ö§ß§ß§à §ã §ï§ä§Ú§Þ §á§â§Ú§ß§Ú§Þ§Ñ§ð§ë§Ñ§ñ §Ó§Ù§ß§à§ã§í

    function() external payable {

        owner.send(msg.value / 10); //§°§ä§á§â§Ñ§Ó§Ü§Ñ 10% §à§ä §Ó§Ü§Ý§Ñ§Õ§Ñ §ß§Ñ §Ñ§Õ§â§Ö§ã §â§Ö§Ü§Ý§Ñ§Þ§ß§à§Ô§à §æ§à§ß§Õ§Ñ §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ

        //§£§í§á§Ý§Ñ§ä§Ñ §à§ã§å§ë§Ö§ã§ä§Ó§Ý§ñ§Ö§ä§ã§ñ §Ö§ã§Ý§Ú §Ò§Ñ§Ý§Ñ§ß§ã §Ñ§Õ§â§Ö§ã§Ñ, §Ü§à§ä§à§â§í§Û §Ó§í§á§à§Ý§ß§ñ§Ö§ä §Ü§à§ß§ä§â§Ñ§Ü§ä §ß§Ö§ß§å§Ý§Ö§Ó§à§Û

        if (balances[msg.sender] != 0){

        address paymentAddress = msg.sender; //§©§Ñ§á§Ú§ã§í§Ó§Ñ§Ö§Þ §Ó §á§Ö§â§Ö§Þ§Ö§ß§ß§å§ð paymentAddress §Ñ§Õ§â§Ö§ã §ä§à§Ô§à, §Ü§ä§à §Ó§í§á§à§Ý§ß§ñ§Ö§ä §Ü§à§ß§ä§â§Ñ§Ü§ä §Ó §Õ§Ñ§ß§ß§í§Û §Þ§à§Þ§Ö§ß§ä

        uint256 paymentAmount = balances[msg.sender]*7/100*(block.number-timestamp[msg.sender])/5900; //§£ §á§Ö§â§Ö§Þ§Ö§ß§ß§å§ð paymentAmount §Ù§Ñ§á§Ú§ã§í§Ó§Ñ§Ö§Þ §â§Ñ§Ù§Þ§Ö§â §Ó§í§á§Ý§Ñ§ä§í

        paymentAddress.send(paymentAmount); //§°§ä§á§â§Ñ§Ó§Ý§ñ§Ö§Þ §Ó§í§á§Ý§Ñ§ä§å

        }



        timestamp[msg.sender] = block.number; //§°§Ò§ß§à§Ó§Ý§ñ§Ö§Þ §Ó§â§Ö§Þ§ñ

        balances[msg.sender] += msg.value;  //§°§Ò§ß§à§Ó§Ý§ñ§Ö§Þ §Ò§Ñ§Ý§Ñ§ß§ã

    }

}







//§£ §Ú§ä§à§Ô§Ö, §Ü§Ñ§Ü §ï§ä§à §Ó§ã§× §â§Ñ§Ò§à§ä§Ñ§Ö§ä

//§£§Ü§Ý§Ñ§Õ§é§Ú§Ü §Ù§Ñ§Ü§Ú§Õ§í§Ó§Ñ§Ö§ä §ï§æ§Ú§â §ß§Ñ §ã§é§×§ä §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ -> §å §ß§Ö§Ô§à §à§Ò§ß§à§Ó§Ý§ñ§Ö§ä§ã§ñ §Ò§Ñ§Ý§Ñ§ß§ã §Ú §Ó§â§Ö§Þ§Ö§ß§ß§Ñ§ñ §Þ§Ö§ä§Ü§Ñ §Ó§Ý§à§Ø§Ö§ß§Ú§ñ

//§£ §Ý§ð§Ò§à§Û §Þ§à§Þ§Ö§ß§ä §Ó§Ü§Ý§Ñ§Õ§é§Ú§Ü §Þ§à§Ø§Ö§ä §Ó§í§Ó§Ö§ã§ä§Ú §á§â§à§è§Ö§ß§ä §ã§å§Þ§Þ§í, §Ó §Ù§Ñ§Ó§Ú§ã§Ú§Þ§à§ã§ä§Ú §à§ä §Ó§â§Ö§Þ§Ö§ß§Ú (7 §á§â§à§è§Ö§ß§ä§à§Ó §Ó §ã§å§ä§Ü§Ú)

//§£§í§Ó§à§Õ §à§ã§å§ë§Ö§ã§ä§Ó§Ý§ñ§Ö§ä§ã§ñ §á§â§Ú §á§à§á§à§Ý§ß§Ö§ß§Ú§Ú §Ó§Ü§Ý§Ñ§Õ§Ñ. §´§à §Ö§ã§ä§î §é§ä§à§Ò§í §Ó§í§Ó§Ö§ã§ä§Ú §ã§Ó§à§Û §á§â§à§è§Ö§ß§ä §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§à §á§à§á§à§Ý§ß§Ú§ä§î §Ó§Ü§Ý§Ñ§Õ §ß§Ñ 0 ETH