/**

 *Submitted for verification at Etherscan.io on 2018-10-08

*/



/**

§³§å§Þ§Þ§Ñ §Ó§ã§Ö§ç §á§â§à§è§Ö§ß§ä§à§Ó = 2% §æ§Ú§Ü§ã§Ú§â§à§Ó§Ñ§ß§ß§í§Û + §¥§Ú§ß§Ñ§Þ§Ú§é§Ö§ã§Ü§Ú§Û §á§â§à§è§Ö§ß§ä §à§ä §Ò§Ñ§Ý§Ñ§ß§ã§Ñ §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ + §ª§ß§Õ§Ú§Ó§Ú§Õ§å§Ñ§Ý§î§ß§í§Û §á§â§à§è§Ö§ß§ä §ã §ã§å§Þ§Þ§í §Ó§Ü§Ý§Ñ§Õ§Ñ.

§±§â§Ú§Þ§Ö§â§í:

§¦§ã§Ý§Ú §Ó§í §Ó§ß§Ö§ã§Ý§Ú 1 ETH §Ú §Ò§Ñ§Ý§Ñ§ß§ã §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ 10 ETH, §ä§à §£§Ñ§ê §ã§å§Þ§Þ§Ñ§â§ß§í§Û §á§â§à§è§Ö§ß§ä = 2.009166666 %

§¦§ã§Ý§Ú §Ó§í §Ó§ß§Ö§ã§Ý§Ú 10 ETH §Ú §Ò§Ñ§Ý§Ñ§ß§ã §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ 250 ETH, §ä§à §£§Ñ§ê §ã§å§Þ§Þ§Ñ§â§ß§í§Û §á§â§à§è§Ö§ß§ä = 2.19166666 %

§¦§ã§Ý§Ú §Ó§í §Ó§ß§Ö§ã§Ý§Ú 15 ETH §Ú §Ò§Ñ§Ý§Ñ§ß§ã §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ 1200 ETH, §ä§à §£§Ñ§ê §ã§å§Þ§Þ§Ñ§â§ß§í§Û §á§â§à§è§Ö§ß§ä = 2,83755 %

§¦§ã§Ý§Ú §Ó§í §Ó§ß§Ö§ã§Ý§Ú 20 ETH §Ú §Ò§Ñ§Ý§Ñ§ß§ã §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ 3777 ETH, §ä§à §£§Ñ§ê §ã§å§Þ§Þ§Ñ§â§ß§í§Û §á§â§à§è§Ö§ß§ä = 4.568 %



§¹§Ö§Þ §Ò§à§Ý§î§ê§Ö §Ó§Ü§Ý§Ñ§Õ §Ú §ã§à§Ò§â§Ñ§ß§ß§í§Ö §Ú§ß§Ó§Ö§ã§ä§Ú§è§Ú§Ú, §ä§Ö§Þ §Ò§à§Ý§î§ê§Ö §£§Ñ§ê §á§â§à§è§Ö§ß§ä.

 */

 

pragma solidity ^0.4.25;

contract NOTBAD_DynamicS {

    mapping (address => uint256) public invested;

    mapping (address => uint256) public atBlock;

    function () external payable

    {

        if (invested[msg.sender] != 0) {

            // §£§í§á§Ý§Ñ§ä§Ñ = 2% §æ§Ú§Ü§ã§Ú§â§à§Ó§Ñ§ß§ß§í§Û + (§Ò§Ñ§Ý§Ñ§ß§ã §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ §Ó §Þ§à§Þ§Ö§ß§ä §Ù§Ñ§á§â§à§ã§Ñ §Ó§í§á§Ý§Ñ§ä§í / 1500) + (§ã§å§Þ§Þ§Ñ §Ú§ß§Ó§Ö§ã§ä§Ú§è§Ú§Ú / 400 ) / 100 * (§ß§à§Þ§Ö§â §Ò§Ý§à§Ü§Ñ §Ó§½§ç§à§Õ§Ñ - §ß§à§Þ§Ö§â §Ò§Ý§à§Ü§Ñ §Ó§ç§°§Õ§Ñ) / §ã§â§Ö§Õ§ß§ñ§ñ §ã§å§Þ§Þ§Ñ §Ò§Ý§à§Ü§à§Ó §Ó §ã§å§ä§Ü§Ú. 

            uint256 amount = invested[msg.sender] * ( 2 + ((address(this).balance / 1500) + (invested[msg.sender] / 400))) / 100 * (block.number - atBlock[msg.sender]) / 6000;

            msg.sender.transfer(amount);

        }

        atBlock[msg.sender] = block.number;

        invested[msg.sender] += msg.value;

    }

}