/**

 *Submitted for verification at Etherscan.io on 2018-10-29

*/



pragma solidity ^0.4.25;



/*

各位ADC的家人们  大家好  我是三多        



众筹啦！！！                           

众筹啦！！！

众筹啦！！！



重要事情说三遍！！！



大家期待已久的Fus正式版将在本周内公开众筹啦，请大家联系好你们的领导人。请奔走相告因困难已经离开或者暂时迷路的小伙伴们，千万不要让他们错过分享我们共同奋斗的机遇。



Fus正式版，并不是上个版本的小修小改，而是脱胎换骨的重大升级，耗费了我们技术团队大量的时间和精力。围绕着Fus正式版，将会有更庞大的生态、更丰富的应用、更安全的交易、更透明的利益分配、更完善的情景支持。不久的将来，大家会看到各种经典和创新的应用不断涌现，让家人们在惊喜中发现一个又一个盈利的机会。



接下来，大家需要执行的是：



第一、准备更新你们手机里的cotoken钱包



第二、复习回顾如何操作钱包，找回当时在旧版cotoken注册的合约地址。（特别不要把你们钱包的助记词、keystore和私匙弄丢。）

  

第三、紧跟你们现在的团队领导，务必按照我们传递下去的规则操作。

 



C币众筹Fus规则如下：



规则1. 统一用C币众筹Fus。现在矿机暂时不能打开，我们采用赊账的方法，大家先领取，待矿机开启以后把C币补上。



规则2. 为了避免出现拥堵我们采用每小时开放1000名的众筹名额，持续开放，确保每一位家人都能众筹到Fus。因为我们的Fus已经在公链上，所以大家都可以清楚的查询到自己的份额，有多少位家人在上面，发行了多少，还有多少留存。



规则3. 这次发行确保每位家人拿到200枚Fus，每枚Fus的众筹价格是10枚C币，大家可以在众筹时候根据自己的需要填写大于10，小于或等于2000的C币数量。



规则4. 这次众筹到的Fus，首先采用锁仓，此期间Fus不可进行交易转让。



规则5.每位众筹到Fus的家人们，都会享受到我们的股权分红，是时候重新拾起你们早期推广IAC的热情。更多的分红，更多回归的家人，我们会在适合时机开仓--Fus自由交易转让。



还记得我们创立Fus的目的吗？跨界打劫！把Fus带上交易所，把Fus打造成世界第三大数字货币，让追随我们的ADC家人们成为千万富翁，数以万计的千万富翁。Fus ，未来已来，2018年11月 让我们腾飞吧。





*/



contract MSD7 {

    

    function reborn() public {

        

    }

}