/**

 *Submitted for verification at Etherscan.io on 2018-12-02

*/



pragma solidity ^0.4.25;



/*



亲爱的家人们，很高兴LW2.0 已经上线了。我们的技术团队一直跟踪币圈算力大战，终于在我方获得胜利后上线LW2.0。一个晚上我们的节点已经来到第16个节。这个预示着下一节的第一个玩家将会获得18倍的收益。大家不仅收获数倍的ETH，更迎来币市回升。家人们，错过了FOMO 3D，我们错过了财富翻10倍，错过了LW1.0大家错过了财富翻15倍的机会。LW 2.0的到来将会20倍，30倍，甚至100倍的收益。



第一点:跟大家讲讲LW2.0的规则，如何收获百倍财富:



1\LW2.0和1.0有本质的区别，LW1.0是最开始大量投入，游戏只要没结束最前面的都是躺赢，导致后面很多人都为最前面的人做嫁衣，不敢再进场。这个不利于我们家人推广。



2\我们把LW2.0一轮游戏分成很多节，每一节都是分隔开的，让后面进场的玩家不需要贡献给上一节的玩家。开始的时候都是小节进去，风险不大。而越往后面的节，进场人数越多，则FUS提成越大，那样我们持有FUS股权的家人分红就越多。



3\直接以太购买种子，每颗0.002以太币。每次可购买1—500颗种子，可购买多次，为了获得FUS永久分红权，建议大家首次至少购买50颗（50*0.002=0.1ETH）以上的种子，激活FUS分红资格。



4\LW2.0的算法图文已经公开，玩家们可以更清楚、更精准、更理性地参与游戏。



5\我们是蚁群传播，我们的强项是推广，让以前迷路的家人回家壮大我们的队伍，一起推广。让外面的玩家进场，让更多的人持有FUS，并且去使用它的应用。



6\LW2.0之后，BIIGO2.0等应用将会陆续回归，这样我们家人就会在FUS的分红中回血，FUS也会落地更多的应用，我们也会营造一个生态让每个家人都可以不需要技术团队就能开发一个产品应用，只要拥有足够FUS甚至是不需要投入也能落地新应用，每个家人都可以是一个项目的老板，只要大家有足够的推广能力。因为基于区块的应用项目可以说是无限可能的，那时候FUS的价值将会超过ETH ，家人们到时候可能都不想出售FUS。因为那时候，持有FUS就是躺赢的节奏。



第二点，要说一下大家忽略的一个应用，面对面扫一扫这功能。



该应用的目的就是让家人们可以便捷地推广，让家人清楚这个工具是你们合法赚币的重要工具，让身边的人更便捷的获得以太币，参与里面的应用。家人们一定要明白，能否回血并且创造巨额财富的关键，就是大家的推广能力，币圈一天，人间十年。



第三点， 苹果手机的用户要注意



苹果手机的某些用户在这两天出现了闪退现象，这是某些钱包的漏洞造成，目前该漏洞已经修复了，使用苹果手机的家人可以进场参与了，也可以推广苹果手机的用户了。



第四点，大家十分关心的FUS分红问题，



我们会在每月进行两次的分红。待分红功能启动后，大家可留意一下APP中“我的资产”里面提示的具体时间。



*/



contract MSD10 {

    

    function LW2() public {

        

    }

}